lvx/base/Catalogs/бит_КлючиСценарийЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КлючиСценарийЦФО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЗапретаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыЗапретаИзмененияДанныхБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/InformationRegisters/бит_АналитикаСценарийЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_АналитикаСценарийЦФО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/AccountingRegisters/бит_Бюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>бит_Бюджетирование</Name>
			<Comment>(БИТ)</Comment>
			<ChartOfAccounts>ChartOfAccounts.бит_Бюджетирование</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.бит_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Comment>Сумма в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.бит_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.бит_Бюджетирование.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСценарийЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ГраницыФиксацииБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ГраницыФиксацииБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_КлючиСценарийЦФО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ЗаменитьДублиКлючейАналитики() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.ПометкаУдаления КАК ПометкаУдаления,
	|	Аналитика.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	Справочник.бит_КлючиСценарийЦФО КАК ДанныеСправочника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК ДанныеРегистра
	|		ПО ДанныеСправочника.Ссылка = ДанныеРегистра.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК Аналитика
	|		ПО ДанныеСправочника.Сценарий = Аналитика.Сценарий
	|			И ДанныеСправочника.ЦФО = Аналитика.ЦФО
	|ГДЕ
	|	ДанныеРегистра.КлючАналитики ЕСТЬ NULL";

	// Сформируем соответствие ключей аналитики.
	СоответствиеАналитик = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СоответствиеАналитик.Вставить(Выборка.Ссылка, Выборка.КлючАналитики);
			
			Если Не Выборка.ПометкаУдаления Тогда
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				// АПК:280-выкл - Допустимо пропустить обработку исключения, так как
				// это не останавливающая операция.
				Попытка
					СправочникОбъект.УстановитьПометкуУдаления(Истина, Ложь);
				Исключение
					// Обработка не требуется.
				КонецПопытки;
				// АПК:280-вкл.
			КонецЕсли;

		КонецЦикла;
		
		Для каждого КлючЗначение Из СоответствиеАналитик Цикл
			ПарыЗамен = Новый Соответствие;
			ПарыЗамен.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			
			ПараметрыЗамены = ОбщегоНазначения.ПараметрыЗаменыСсылок();
			ПараметрыЗамены.ВключатьБизнесЛогику 	= Ложь;
			ПараметрыЗамены.ЗаменаПарыВТранзакции 	= Ложь;
			ПараметрыЗамены.ПривилегированнаяЗапись = Истина;
			
			ОбщегоНазначения.ЗаменитьСсылки(ПарыЗамен, ПараметрыЗамены);
		КонецЦикла; 
	КонецЕсли;
		
КонецПроцедуры

// Находит неиспользуемые ключи аналитики связанные с помеченными на удаление объектами и устанавливает
// у таких ключей пометку на удаление.
// Ключи считаются свободными если они ссылаются на Сценарий и ЦФО, помеченные на удаление, и не участвуют в движениях
// регистра накопления бит_ОборотыПоБюджетам.
//
Процедура ПометитьНаУдалениеНеиспользуемыеКлючиАналитики() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлючиАналитики.Ссылка
	|ИЗ
	|	Справочник.бит_КлючиСценарийЦФО КАК КлючиАналитики";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьПоиска = Новый Массив;
	ОбластьПоиска.Добавить(Метаданные.Справочники.СценарииПланирования.ПолноеИмя());
	ОбластьПоиска.Добавить(Метаданные.Справочники.Подразделения.ПолноеИмя());
	
	СценарийЦФО = НайтиПомеченныеНаУдаление(Новый Массив, ОбластьПоиска);
	
	Если СценарийЦФО.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СценарийЦФО", СценарийЦФО);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлючиАналитики.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ КлючиАналитики
	|ИЗ
	|	Справочник.бит_КлючиСценарийЦФО КАК КлючиАналитики
	|ГДЕ
	|	КлючиАналитики.Сценарий В(&СценарийЦФО)
	|	И КлючиАналитики.ЦФО В(&СценарийЦФО)
	|	И НЕ КлючиАналитики.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючиАналитики.Ссылка КАК Ссылка,
	|	ОборотыПоБюджетам.Сценарий КАК Сценарий
	|ПОМЕСТИТЬ НеиспользуемыеКлючи
	|ИЗ
	|	КлючиАналитики КАК КлючиАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|		ПО КлючиАналитики.Ссылка = ОборотыПоБюджетам.КлючСценарийЦФО
	|ГДЕ
	|	ОборотыПоБюджетам.Сценарий ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеиспользуемыеКлючи.Ссылка КАК Ссылка
	|ИЗ
	|	НеиспользуемыеКлючи КАК НеиспользуемыеКлючи";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		КлючАналитики = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		КлючАналитики.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеПриПереходеНаНовуюВерсию

Процедура ИнициализироватьКлючиПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.Сценарий КАК Сценарий,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ ДанныеРегистров
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты КАК бит_ОборотыПоБюджетамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_БюджетированиеОбороты.Сценарий,
	|	бит_БюджетированиеОбороты.ЦФО
	|ИЗ
	|	РегистрБухгалтерии.бит_Бюджетирование.Обороты КАК бит_БюджетированиеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистров.Сценарий КАК Сценарий,
	|	ДанныеРегистров.ЦФО КАК ЦФО
	|ИЗ
	|	ДанныеРегистров КАК ДанныеРегистров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК бит_АналитикаСценарийЦФО
	|		ПО ДанныеРегистров.Сценарий = бит_АналитикаСценарийЦФО.Сценарий
	|			И ДанныеРегистров.ЦФО = бит_АналитикаСценарийЦФО.ЦФО
	|ГДЕ
	|	бит_АналитикаСценарийЦФО.КлючАналитики ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элемент = Справочники.бит_КлючиСценарийЦФО.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Элемент, ВыборкаДетальныеЗаписи);
		Элемент.Наименование = НаименованиеКлючаСценарийЦФО(Элемент);
		Элемент.УстановитьНовыйКод();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Элемент);
		
		НаборЗаписей = РегистрыСведений.бит_АналитикаСценарийЦФО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сценарий.Установить(ВыборкаДетальныеЗаписи.Сценарий);
		НаборЗаписей.Отбор.ЦФО.Установить(ВыборкаДетальныеЗаписи.ЦФО);
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.КлючАналитики = Элемент.Ссылка;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКлючиВРНОборотыПоБюджетамПриПереходеНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	бит_ОборотыПоБюджетам.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК бит_ОборотыПоБюджетам
	|ГДЕ
	|	бит_ОборотыПоБюджетам.КлючСценарийЦФО = ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.Пустаяссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	ОбработаноОбъектов 			 = 0;
	
	НаборЗаписей = РегистрыНакопления.бит_ОборотыПоБюджетам.СоздатьНаборЗаписей();
	Выборка 	 = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();

		Для каждого Запись Из НаборЗаписей Цикл
			Запись.КлючСценарийЦФО = Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Запись);
		КонецЦикла; 
		
		Попытка
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ОбработаноОбъектов = ОбработаноОбъектов + 1;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось заполнить ключ ""Сценарий, ЦФО"" для документа %1 по причине:
									|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Регистратор, 
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Регистратор.Метаданные(), 
				Выборка.Регистратор, ТекстСообщения);
		КонецПопытки; 
	КонецЦикла;
	
	Если ОбработаноОбъектов > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Процедура ЗаполнитьКлючиВРНОборотыПоБюджетамПриПереходеНаНовуюВерсию: обработано документов: %1'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработаноОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьКлючиВРББюджетированиеПриПереходеНаНовуюВерсию(Параметры) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	бит_Бюджетирование.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрБухгалтерии.бит_Бюджетирование КАК бит_Бюджетирование
	|ГДЕ
	|	бит_Бюджетирование.КлючСценарийЦФО = ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.Пустаяссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	ОбработаноОбъектов 			 = 0;
	
	НаборЗаписей = РегистрыБухгалтерии.бит_Бюджетирование.СоздатьНаборЗаписей();
	Выборка 	 = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();

		Для каждого Запись Из НаборЗаписей Цикл
			Запись.КлючСценарийЦФО = Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Запись);
		КонецЦикла; 
		
		Попытка
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ОбработаноОбъектов = ОбработаноОбъектов + 1;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось заполнить ключ ""Сценарий, ЦФО"" для документа %1 по причине:
									|%2'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Регистратор, 
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Регистратор.Метаданные(), 
				Выборка.Регистратор, ТекстСообщения);
		КонецПопытки; 
	КонецЦикла;
	
	Если ОбработаноОбъектов > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Процедура ЗаполнитьКлючиВРББюджетированиеПриПереходеНаНовуюВерсию: обработано документов: %1'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработаноОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПеренестиНастойкиФиксации() Экспорт
	
	Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку(Новый УникальныйИдентификатор("cb9767ea-9c3f-4328-9140-64b3ffea3089"));
	Если НЕ ЗначениеЗаполнено(Раздел) Тогда
		ВызватьИсключение НСтр("ru = 'Не найден раздел даты запрета изменения ""Бюджетирование""'") ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ГраницыФиксацииБюджета.Сценарий КАК Сценарий,
	|	бит_ГраницыФиксацииБюджета.ЦФО КАК ЦФО,
	|	МАКСИМУМ(бит_ГраницыФиксацииБюджета.ДатаФиксации) КАК ДатаЗапрета
	|ПОМЕСТИТЬ ВТГраницыФиксации
	|ИЗ
	|	РегистрСведений.бит_ГраницыФиксацииБюджета КАК бит_ГраницыФиксацииБюджета
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ГраницыФиксацииБюджета.Сценарий,
	|	бит_ГраницыФиксацииБюджета.ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГраницыФиксации.Сценарий КАК Сценарий,
	|	ВТГраницыФиксации.ДатаЗапрета КАК ДатаЗапрета,
	|	Подразделения.Ссылка КАК ЦФО
	|ИЗ
	|	ВТГраницыФиксации КАК ВТГраницыФиксации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО (ВТГраницыФиксации.ЦФО = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|			И (НЕ Подразделения.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТГраницыФиксации.Сценарий,
	|	ВТГраницыФиксации.ДатаЗапрета,
	|	ВТГраницыФиксации.ЦФО
	|ИЗ
	|	ВТГраницыФиксации КАК ВТГраницыФиксации
	|ГДЕ
	|	ВТГраницыФиксации.ЦФО <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|ИТОГИ ПО
	|	Сценарий,
	|	ДатаЗапрета";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НачатьТранзакцию();
		Попытка
			
			ВыборкаСценарий = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСценарий.Следующий() Цикл
				ВыборкаДата = ВыборкаСценарий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДата.Следующий() Цикл
					
					Наименование  = НСтр("ru = '%1, по %2'; en = '%1, to %2'"); 
					ГруппаЗапрета = Справочники.бит_ГруппыЗапретаИзмененияДанныхБюджетирования.СоздатьЭлемент();
					ГруппаЗапрета.Наименование = СтрШаблон(Наименование, ВыборкаДата.Сценарий, 
													Формат(ВыборкаДата.ДатаЗапрета, "ДЛФ=D"));
					ГруппаЗапрета.Записать();
					
					ВыборкаДетали = ВыборкаДата.Выбрать();
					Пока ВыборкаДетали.Следующий() Цикл
						Ключ = КлючиСценарийЦФОДокумента(ВыборкаДетали);	
						ТекущийОбъект = Ключ.ПолучитьОбъект(); 
						ТекущийОбъект.ГруппаЗапретаИзменения = ГруппаЗапрета.Ссылка;
						ТекущийОбъект.Записать();
					КонецЦикла; 
					Данные = Новый Структура; 
					Данные.Вставить("Раздел", Раздел);
					Данные.Вставить("Объект", ГруппаЗапрета.Ссылка);
					Данные.Вставить("Пользователь", Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
					Данные.Вставить("ДатаЗапрета", ВыборкаДата.ДатаЗапрета);
					
					МенеджерЗаписи = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Данные);
					МенеджерЗаписи.Записать(Истина);
				КонецЦикла; 
			КонецЦикла;
			
			Данные = Новый Структура; 
			Данные.Вставить("Раздел", Раздел);
			Данные.Вставить("Объект", Раздел);
			Данные.Вставить("Пользователь", Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
			Данные.Вставить("ДатаЗапрета", '0001-01-01');
			
			МенеджерЗаписи = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Данные);
			МенеджерЗаписи.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось перенести настройки фиксации по причине:
	                                |%1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Перенос настроек фиксации бюджета'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ТекстСообщения);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки; 
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти 

// Функция получает ключ Сценарий, ЦФО для текущего документа.
// Параметры:
//	РеквизитыДокумента - Структура или ВыборкаИзРезультатаЗапроса - Данные документа.
//
// Возвращаемое значение:
//	СправочникСсылка.бит_КлючиСценарийЦФО - Найденный ключ.
//
Функция КлючиСценарийЦФОДокумента(РеквизитыДокумента = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначенияАналитик = ЗначенияАналитикСценарийЦФО(РеквизитыДокумента);
	
	МенеджерЗаписи = РегистрыСведений.бит_АналитикаСценарийЦФО.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначенияАналитик);
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Результат = МенеджерЗаписи.КлючАналитики;
	Иначе
		Результат = СоздатьКлючАналитики(ЗначенияАналитик);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеКлючаСценарийЦФО(СправочникОбъект)
	
	Наименование = "";
	НаименованиеЗаполнено = Ложь;
	
	Если ЗначениеЗаполнено(СправочникОбъект.Сценарий) Тогда
		Наименование = Наименование	+ СправочникОбъект.Сценарий + ", ";
		НаименованиеЗаполнено = Истина;
	Иначе
		Наименование = Наименование	+ "<...>, ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СправочникОбъект.ЦФО) Тогда
		Наименование = Наименование	+ СправочникОбъект.ЦФО;
		НаименованиеЗаполнено = Истина;
	Иначе
		Наименование = Наименование	+ "<...>";
	КонецЕсли;
		
	Если НЕ НаименованиеЗаполнено Тогда
		Наименование = "<...>";
	КонецЕсли;	
		
	Возврат Наименование;

КонецФункции

Функция ЗначенияАналитикСценарийЦФО(РеквизитыДокумента)
	
	ЗначенияАналитик = Новый Структура("Сценарий, ЦФО"); 
	ЗаполнитьЗначенияСвойств(ЗначенияАналитик, РеквизитыДокумента);
	
	Возврат ЗначенияАналитик;
	
КонецФункции

Функция КлючСценарийЦФО(ЗначенияАналитик)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ключ.Сценарий КАК Сценарий,
	|	Ключ.ЦФО КАК ЦФО,
	|	Ключ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_КлючиСценарийЦФО КАК Ключ
	|ГДЕ
	|	Ключ.Сценарий = &Сценарий
	|	И Ключ.ЦФО = &ЦФО
	|	И НЕ Ключ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Сценарий", ЗначенияАналитик.Сценарий);
	Запрос.УстановитьПараметр("ЦФО",	  ЗначенияАналитик.ЦФО);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.бит_КлючиСценарийЦФО.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СоздатьКлючАналитики(ПараметрыАналитики)

	МенеджерЗаписи = РегистрыСведений.бит_АналитикаСценарийЦФО.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыАналитики);
		
	Результат = КлючСценарийЦФО(ПараметрыАналитики);
	
	// Создание нового ключа аналитики.
	Если Не ЗначениеЗаполнено(Результат) Тогда
		СправочникОбъект = Справочники.бит_КлючиСценарийЦФО.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СправочникОбъект, ПараметрыАналитики);
		СправочникОбъект.Наименование = НаименованиеКлючаСценарийЦФО(СправочникОбъект);
		СправочникОбъект.Записать();

		Результат = СправочникОбъект.Ссылка;
	КонецЕсли;

	МенеджерЗаписи.КлючАналитики = Результат;
	МенеджерЗаписи.Записать(Ложь);

	Возврат Результат;

КонецФункции

#КонецОбласти 

#КонецЕсли
